{
  "common": {
    "title": "Mon Portfolio",
    "description": "Portfolio de développeur web",
    "home": "Accueil",
    "projects": "Projets",
    "skills": "Compétences",
    "contact": "Contact",
    "blog": "Blog"
  },
  "header": {
    "til": "T.I.L",
    "projects": "Projets",
    "blog": "Blog",
    "work": "Work",
    "skills_tools": "Compétences & Outils",
    "experience": "Expérience",
    "studio": "Studio",
    "contact": "Contact",
    "action_center": "Centre d'actions",
    "dark_mode": "Mode sombre",
    "off": "Off",
    "on": "On",
    "focus": "Focus",
    "focus_mode_description": "Le mode focus réduit les distractions en masquant les composants flottants, comme la navigation et les réactions."
  },
  "footer": {
    "about_me": "À propos de moi",
    "about_description": "Je suis Emane Daniel Akim, un développeur full-stack passionné par le développement et la conception de technologies intuitives, propres et modernes.",
    "work": "Travail",
    "contact": "Contact",
    "experience": "Expérience",
    "skills_and_tools": "Compétences et Outils",
    "studio": "Studio",
    "learn": "Apprendre",
    "docs": "Documentation",
    "personal_blog": "Blog Personnel",
    "til": "T.I.L",
    "copyright": "© 2025, Emanedaniel.fr",
    "github_updates": "Voir les mises à jour récentes sur GitHub"
  },
  "home": {
    "hi": "Bonjour",
    "i'm": "Je suis",
    "a": "Un",
    "role": "Développeur Web",
    "description": "Je développe des interfaces web modernes et attrayantes.",
    "contact_me": "Me Contacter",
    "resume": "CV",
    "full_stack_developer": "Développeur Full Stack Junior",
    "passionate_about_it": "passionné par l'IT, ainsi que le développement web et mobile.",
    "current_stack_tools": "Stack/Outils actuels:",
    "secure_and_reliable": "En apprentissage constant",
    "scalable_architecture": "Approche méthodique",
    "high_performance": "Solutions efficaces",
    "secure_and_reliable_description": "Je me forme continuellement aux bonnes pratiques de sécurité et de fiabilité pour garantir la protection des données et le bon fonctionnement des applications que je développe.",
    "scalable_architecture_description": "J'applique des méthodes structurées pour créer des solutions évolutives, en m'adaptant progressivement aux besoins croissants des projets sur lesquels je travaille.",
    "high_performance_description": "Je m'efforce de développer des applications optimisées et efficaces, en m'appuyant sur les bonnes pratiques et les outils modernes pour offrir une expérience fluide.",
    "robust_and_scalable": "En développement technique",
    "structured_logic_with_focus_on_performance_and_security": "Logique structurée avec apprentissage des concepts de performance et sécurité.",
    "designing_modular_secure_apis_with_scalable_architecture_prioritizing_clean_code_and_efficient_data_flow": "Création d'APIs modulaires en apprenant les principes de sécurité et d'architecture évolutive, en privilégiant la clarté du code et l'efficacité du flux de données.",
    "reliable_and_automated": "En découverte des outils",
    "infrastructure_as_code_with_seamless_ci_cd": "Initiation à l'infrastructure en code et au CI/CD.",
    "emphasizing_automation_monitoring_and_reliability_to_ensure_smooth_deployments_and_maintain_high_system_uptime": "Apprentissage de l'automatisation, de la surveillance et des techniques pour assurer des déploiements fluides et maintenir une bonne disponibilité du système.",
    "development": "Développement: Transformation",
    "coffee": "Café",
    "into": "en",
    "code": "Code",
    "then": "Puis",
    "magic": "Magie",
    "backend": "Backend (En développement)",
    "resilient_modular_high_performance_architecture": "Architecture structurée et fonctionnelle",
    "build_robust_systems_with_clean_logic_optimized_for_speed_scalability_and_security": "Création de systèmes fonctionnels avec une logique claire, en apprenant à optimiser pour la vitesse, l'évolutivité et la sécurité.",
    "architecture": "Architecture",
    "modular_layered_architecture_ensuring_maintainability_and_reusability": "Architecture modulaire en construction, appliquant les bonnes pratiques pour faciliter la maintenance et la réutilisation.",
    "data_flow": "Flux de données",
    "efficient_api_and_database_interaction_with_clean_request_response_handling": "Création d'interactions entre API et bases de données avec un traitement méthodique des requêtes/réponses.",
    "security": "Sécurité",
    "input_validation_encryption_and_auth_protocols_to_protect_data_and_services": "Application des principes de validation des entrées et des protocoles d'authentification pour protéger les données.",
    "performance": "Performance",
    "optimized_queries_caching_and_async_processes_for_lightning_fast_execution": "Apprentissage des techniques d'optimisation de requêtes et de processus asynchrones pour améliorer les performances.",
    "infrastructure_as_code": "Infrastructure en code",
    "declarative_configurations_using_tools_like_terraform_or_cloudformation": "Découverte des configurations avec des outils comme Docker et initiation aux concepts d'infrastructure en tant que code.",
    "ci_cd_pipelines": "Pipelines CI/CD",
    "automated_testing_build_and_deployment_for_rapid_delivery_cycles": "Exploration des processus de tests automatisés et déploiement continu pour faciliter le cycle de développement.",
    "monitoring": "Surveillance",
    "logging_alerting_and_metrics_tracking_for_system_reliability": "Mise en place des bases de journalisation et de surveillance pour améliorer la fiabilité des applications.",
    "cloud_native_tools_and_container_orchestration_for_on_demand_scaling": "Familiarisation avec les outils cloud et la conteneurisation pour répondre aux besoins d'évolutivité.",
    "scalability": "Évolutivité",
    "learn_more": "En savoir plus"
  },
  "projects": {
    "low_title": "Projets",
    "title": "Projets",
    "description": "Galerie de mes projets frontend, backend et devops"
  },
  "skills_tools": {
    "title": "Compétences et Outils",
    "description": "Aperçu de toutes les langues de programmation, bibliothèques et outils avec lesquels j'ai travaillé.",
    "started_career": "Je suis développeur web depuis environ",
    "years_old": "ans",
    "scope_interest": "Même si le domaine du développement web est vaste, je me suis particulièrement intéressé et concentré sur le Développement Front-End, le Développement Back-End et l'Ingénierie DevOps.",
    "front_end_developer": "Développeur Front-End",
    "front_end_love": "J'aime créer quelque chose de propre et minimaliste, attrayant et qui a de la valeur, et bien sûr, facile à utiliser.",
    "front_end_enjoy": "J'apprécie vraiment créer des sites web et des applications mobiles avec des composants UI riches, notamment :",
    "web_application": "Applications web",
    "mobile_application": "Applications mobiles",
    "documentation_pages": "Pages de documentation",
    "cms_contents_layout": "Mise en page de contenus CMS",
    "dashboard_layout": "Mise en page de tableau de bord",
    "and_others": "et autres.",
    "simple_websites": "J'aime toujours créer des pages web simples comme des landing pages. Voici les outils avec lesquels je suis à l'aise pour le développement :",
    "typescript_paragraph": "Tout d'abord, le langage de programmation. Je suis très à l'aise avec TypeScript pour le développement web et mobile. Il ajoute la sécurité de type à mes projets et aide à prévenir de nombreuses erreurs courantes.",
    "reactjs_paragraph": "React est ma principale bibliothèque frontend. Je l'utilise pour construire des interfaces utilisateur dynamiques et interactives avec une architecture basée sur les composants qui garde mon code organisé et maintenable.",
    "nextjs_paragraph": "Next.js est mon framework React préféré. J'apprécie son système de routage basé sur les fichiers, ses capacités de rendu côté serveur, et la façon dont il simplifie la construction d'applications rapides et optimisées pour le SEO.",
    "expo_paragraph": "Pour le développement d'applications mobiles, j'utilise Expo avec React Native. Cela me permet de créer des applications mobiles multi-plateformes en utilisant les mêmes paradigmes React que j'utilise pour le développement web.",
    "tailwind_paragraph": "Pour le style, je préfère Tailwind CSS. Son approche utility-first me permet de créer des designs personnalisés rapidement sans quitter mon HTML ou JSX. C'est parfait pour maintenir la cohérence entre les projets.",
    "framer_motion_paragraph": "En ce qui concerne les animations, Framer Motion est ma bibliothèque de prédilection. Elle rend la création d'animations fluides et complexes simple grâce à une API intuitive qui s'intègre parfaitement avec React.",
    "back_end_developer": "Développeur Back-End",
    "back_end_love": "J'aime construire des systèmes robustes, évolutifs, sécurisés et efficaces, toujours avec une architecture propre et des API conviviales pour les développeurs.",
    "back_end_enjoy": "J'apprécie vraiment travailler sur :",
    "restful": "APIs RESTful",
    "auth_systems": "Systèmes d'authentification et d'autorisation",
    "background_tasks": "Traitement de tâches en arrière-plan",
    "database_design": "Conception et optimisation de bases de données (SQL, NoSQL)",
    "realtime_features": "Fonctionnalités en temps réel utilisant WebSockets",
    "third_party_integrations": "Intégrations avec des API et services tiers",
    "small_services": "Bien que j'aime travailler sur des systèmes backend complexes, j'apprécie également construire des services petits et ciblés qui résolvent efficacement un seul problème.",
    "nodejs_paragraph": "Node.js est mon environnement d'exécution principal pour le développement backend. Son modèle d'E/S non bloquant et piloté par les événements le rend parfait pour créer des applications réseau rapides et évolutives.",
    "expressjs_paragraph": "Express.js est mon framework de prédilection pour construire des API RESTful. Il est minimal, flexible et me permet de mettre en place rapidement des services backend robustes avec des routes et des middlewares propres.",
    "nestjs_paragraph": "Lorsque j'ai besoin de plus de structure pour des applications plus importantes, je me tourne vers Nest.js. Il combine des éléments de POO, PF et PFR, offrant une excellente architecture pour les applications de niveau entreprise.",
    "php_paragraph": "Je suis également compétent avec PHP pour le développement côté serveur. C'est un langage polyvalent que j'ai utilisé pour construire diverses applications et services web.",
    "symfony_paragraph": "Symfony est mon framework PHP préféré. J'apprécie son architecture basée sur les composants, sa flexibilité et les outils puissants qu'il fournit pour créer des applications web complexes.",
    "devops_engineer": "Ingénieur DevOps",
    "devops_love": "Je suis passionné par l'optimisation des flux de travail de développement et la garantie de processus de déploiement fluides.",
    "devops_enjoy": "Je continue d'apprendre et de travailler avec :",
    "containerization": "Conteneurisation avec Docker",
    "ci_cd_pipeline": "Pipelines CI/CD",
    "server_configuration": "Configuration et gestion de serveurs",
    "monitoring": "Surveillance et journalisation des systèmes",
    "deployments": "Déploiements automatisés",
    "devops_journey": "Je continue à me développer dans ce domaine, mais j'ai déjà mis en œuvre des solutions efficaces dans mes projets :",
    "docker_paragraph": "J'utilise Docker pour conteneuriser les applications, assurant la cohérence entre différents environnements et simplifiant le processus de déploiement. Je peux configurer des applications multi-conteneurs avec Docker Compose.",
    "github_actions_paragraph": "Pour le CI/CD, j'ai implémenté des workflows GitHub Actions pour automatiser les processus de test, de construction et de déploiement, garantissant la qualité du code et rationalisant les versions.",
    "nginx_paragraph": "J'ai configuré Nginx comme serveur web et proxy inverse pour mes applications, optimisant les performances et gérant la terminaison SSL/TLS pour des connexions sécurisées.",
    "linux_paragraph": "Je maintiens un serveur personnel sous Debian, que j'ai configuré pour héberger divers services, y compris ce portfolio. Cette expérience pratique m'a donné une connaissance concrète de l'administration des serveurs Linux."
  },
  "experience": {
    "title": "Expérience",
    "description": "Mon parcours éducatif et professionnel en développement.",
    "intro": "J'ai commencé mon parcours en informatique au Maroc et j'ai poursuivi ma formation en France. Bien que je n'aie pas encore d'expérience professionnelle en entreprise, j'ai travaillé sur des projets concrets pour développer mes compétences.",
    "education_title": "Formation",
    "education_description": "Mon parcours éducatif m'a permis d'acquérir de solides bases techniques et une compréhension approfondie du développement logiciel.",
    "projects_title": "Projets",
    "projects_description": "Mes projets personnels et freelance m'ont permis de mettre en pratique mes connaissances et d'explorer différentes technologies du web et du mobile.",
    "education": [
      {
        "title": "École d'Ingénieur en Informatique (Maroc)",
        "period": "2018-2021",
        "description": "Études jusqu'en 2ème année. Apprentissage des fondamentaux de la programmation avec le langage C, incluant les structures de données avancées comme les arbres, pointeurs, graphes, etc.\n\nFormation complète comprenant également: systèmes d'exploitation (Linux/Windows), réseaux informatiques (configuration switch, router, etc.), bases de données et langage SQL, programmation orientée objet avec Java, développement web (HTML, CSS, JS, PHP), outils comme Matlab, modélisation avec UML, et notions d'administration réseaux et systèmes.",
        "skills": [
          "Langage C",
          "Java",
          "SQL",
          "Linux/Windows",
          "Réseaux",
          "HTML/CSS/JS",
          "PHP",
          "UML",
          "Matlab",
          "Administration systèmes"
        ],
        "id": "ingenieur-maroc"
      },
      {
        "title": "Titre Professionnel Développeur Web",
        "period": "2023-2024",
        "description": "Formation complète en développement web obtenue il y a un an, couvrant le front-end et le back-end. Approfondissement des connaissances en SQL et programmation orientée objet.",
        "skills": [
          "HTML/CSS",
          "JavaScript",
          "React",
          "Node.js",
          "PHP",
          "SQL",
          "Programmation Orientée Objet"
        ],
        "id": "titre-pro-dev-web"
      }
    ],
    "projects": [
      {
        "title": "Site Web pour un Artiste",
        "period": "2023",
        "description": "Développement d'un site web pour un artiste des beaux-arts en utilisant WordPress (à la demande du client). Le site permet la présentation de ses œuvres et inclut un moyen de le contacter.",
        "skills": [
          "WordPress",
          "Personnalisation de thème",
          "Responsive Design",
          "Optimisation SEO"
        ],
        "id": "site-artiste"
      },
      {
        "title": "Application Mobile de Trading (Demo)",
        "period": "2023-Présent",
        "description": "Développement en cours d'une application mobile de démonstration pour l'achat et la vente d'actions et d'indices africains (JSE, EGX, BVC, NGX, NSE) en utilisant Expo et React Native.",
        "skills": [
          "React Native",
          "Expo",
          "TypeScript",
          "API REST",
          "State Management"
        ],
        "id": "app-trading"
      }
    ]
  },
  "contact": {
    "title": "Contact",
    "subtitle": "Contactez-moi à tout moment, via les réseaux sociaux, par e-mail.",
    "work": "Travail",
    "reminder_start": "Juste un rappel amical que les informations fournies ici sont uniquement à des fins",
    "business_purposes": "professionnelles",
    "reminder_end": ". Si vous avez des questions, n'hésitez pas à discuter directement avec moi sur mes réseaux sociaux.",
    "understanding": "Je vous remercie de votre compréhension pour une utilisation responsable.",
    "contact_section": "Contact",
    "detail": "Détail",
    "address": "Adresse",
    "timezone": "Fuseau horaire",
    "email": "E-mail",
    "further_info": "Si vous avez besoin d'informations supplémentaires, comme mon numéro de téléphone, n'hésitez pas à m'envoyer d'abord un e-mail.",
    "social_media": "Réseaux Sociaux",
    "social_media_text": "Si vous voulez me trouver sur les réseaux sociaux, cherchez simplement",
    "username": "@AkimEmane",
    "username_info": ". C'est mon nom d'utilisateur sur presque toutes les plateformes, donc il devrait être facile de me trouver.",
    "link": "Lien"
  },
  "projects/id": {
    "low_title": "Projet",
    "reaction_already_exists": "Vous avez déjà mis ce type de réaction à ce projet",
    "reaction_added": "Merci pour votre réaction !",
    "reaction_adding": "Ajout de réaction...",
    "reaction_error": "Une erreur est survenue lors de l'ajout de la réaction",
    "sharing": "Partage...",
    "shared": "Merci pour votre partage !",
    "error_sharing": "Merci de réessayer plus tard.",
    "already_shared": "Merci pour votre partage !",
    "visit": "Visiter"
  },
  "blog": {
    "title": "Blog Personnel",
    "subtitle": "Réflexions et histoires de développement web"
  },
  "studio": {
    "title": "Studio",
    "description": "Mon espace de travail à domicile qui me permet de réaliser efficacement la plupart de mes tâches.",
    "equipment": "Équipement",
    "setup_description": "Mon setup est minimaliste mais efficace pour mes besoins quotidiens de développement.",
    "equipment_list": [
      {
        "title": "MacBook Pro (2016)",
        "paragraph": "Intel processor, 8GB RAM, 250GB storage. Mon ordinateur principal pour le développement et la création de contenus."
      },
      {
        "title": "Serveur Lenovo",
        "paragraph": "4GB RAM, 1TB storage. Configuration minimaliste sous Debian sans interface graphique, dédié aux tâches serveur."
      }
    ]
  },
  "til": {
    "title": "T.I.L",
    "description": "Aujourd'hui, j'ai appris"
  }
}
